In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('car.csv')
df.head()

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [3]:
df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [4]:
df.columns=['a','b','c','d','e']

In [5]:
df

        a      b       c  d            e
0  Toyota  White  150043  4   $4,000.00
1   Honda    Red   87899  4   $5,000.00
2  Toyota   Blue   32549  3   $7,000.00
3     BMW  Black   11179  5  $22,000.00
4  Nissan  White  213095  4   $3,500.00
5  Toyota  Green   99213  4   $4,500.00
6   Honda   Blue   45698  4   $7,500.00
7   Honda   Blue   54738  4   $7,000.00
8  Toyota  White   60000  4   $6,250.00
9  Nissan  White   31600  4   $9,700.00